/* Terraform - (C) 1997-2002 Robert Gasch (r.gasch@chello.nl)
 *  - http://terraform.sourceforge.net
 *
 *  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; either version 2 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program; if not, write to the Free Software
 *  Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
 */


#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <libxml/parser.h>
#include "base64.h"
#include "reader.h"
#include "xmlsupport.h"
#include "filters.h"
#include "clocale.h"

#ifdef HAVE_CONFIG_H
#  include <config.h>
#endif

#ifdef HAVE_GDKPIXBUF
#include "gdk-pixbuf/gdk-pixbuf-loader.h"
#include "gdk-pixbuf/gdk-pixbuf.h"
#endif


static TTerrain *t_terrain_load_native       (const gchar *filename);
static TTerrain *t_terrain_import_bmp        (const gchar *filename);
static TTerrain *t_terrain_import_gtopo      (const gchar *filename,
                                              gint         scale);

    terrain->riverfield = g_new (gfloat, width*height);

  heightfield_load_data (node, terrain->riverfield, width, height);

  return terrain->riverfield;
}

static void
riversources_load (TTerrain   *terrain,
		   xmlNodePtr  node)
{
  xmlNode *child;

  child = node->children;
  while (child != NULL)
    {
      TTerrainRiverCoords coords;

      //object.name = g_strdup (xmlGetProp (child, "name"));
      xml_unpack_prop_float (child, "center_x", &coords.x);
      xml_unpack_prop_float (child, "center_y", &coords.y);

      g_array_append_val (terrain->riversources, coords);

      child = child->next;
    }
}

static TTerrain *
t_terrain_load_native (const gchar *filename)
{
  xmlDocPtr  doc;
  xmlNodePtr node;
  TTerrain  *terrain;

  doc = xmlParseFile (filename);
  if (doc == NULL)
    return NULL;

  if (strcmp (doc->children->name, "Terrain") != 0)
    {
      xmlFreeDoc (doc);
      return NULL;
    }

  node = xmlFindChild (doc->children, "Heightfield");

  terrain = NULL;
  if (node != NULL)
    terrain = heightfield_load (node);

  if (terrain != NULL)
    {
      node = xmlFindChild (doc->children, "Options");
      if (node != NULL)
        options_load (terrain, node);
      node = xmlFindChild (doc->children, "Objects");
      if (node != NULL)
        objects_load (terrain, node);
      node = xmlFindChild (doc->children, "Selection");
      if (node != NULL)
        selection_load (terrain, node);
      node = xmlFindChild (doc->children, "Riverfield");
      if (node != NULL)
        riverfield_load (terrain, node);
      node = xmlFindChild (doc->children, "Rivers");
      if (node != NULL)
        riversources_load (terrain, node);

      g_free (terrain->filename);
      terrain->filename = g_strdup (filename);
    }

  xmlFreeDoc (doc);

  return terrain;
}

/* ********************************************** */
/* **** Based on the bmp code from the GIMP  **** */
/* ********************************************** */
/* bmp.c                                          */
/* Version 0.44                                   */
/* This is a File input and output filter for     */
/* Gimp. It loads and saves images in windows(TM) */
/* bitmap format.                                 */
/* Some Parts that deal with the interaction with */
/* the Gimp are taken from the GIF plugin by      */
/* Peter Mattis & Spencer Kimball and from the    */
/* PCX plugin by Francisco Bustamante.            */
/*                                                */
/* Alexander.Schulz@stud.uni-karlsruhe.de         */

/* Changes:   28.11.1997 Noninteractive operation */
/*            16.03.1998 Endian-independent!!     */
/*            21.03.1998 Little Bug-fix           */
/*            06.04.1998 Bugfix in Padding        */
/*            11.04.1998 Arch. cleanup (-Wall)    */
/*                       Parses gtkrc             */
/*            14.04.1998 Another Bug in Padding   */
/* ********************************************** */

typedef struct BmpFileHead BmpFileHead;
struct BmpFileHead
{
  guint32 bfSize;         /* 02 */
  guint32 reserved;       /* 06 */
  guint32 bfOffs;         /* 0A */
  guint32 biSize;         /* 0E */
};

typedef struct BmpHead BmpHead;
struct BmpHead
{
  guint32 biWidth;        /* 12 */
  guint32 biHeight;       /* 16 */
  guint16 biPlanes;       /* 1A */
  guint16 biBitCnt;       /* 1C */
  guint32 biCompr;        /* 1E */
  guint32 biSizeIm;       /* 22 */
  guint32 biXPels;        /* 26 */
  guint32 biYPels;        /* 2A */
  guint32 biClrUsed;      /* 2E */
  guint32 biClrImp;       /* 32 */
                          /* 36 */
};

typedef struct BmpOS2Head BmpOS2Head;
struct BmpOS2Head
{
  guint16 bcWidth;        /* 12 */
  guint16 bcHeight;       /* 14 */
  guint16 bcPlanes;       /* 16 */
  guint16 bcBitCnt;       /* 18 */
};

static gint
bmp_read_palette (FILE   *in,
                  guchar  buffer[256][3],
                  gint    count,
                  gint    size)
{
  gint   i;
  guchar rgb[4];

  for (i = 0; i < count; i++)
    {
      if (fread (&rgb, size, 1, in) != 1)
        {
          /* Failure. */
          return -1;
        }

      /* Bitmap save the colors in another order! */
      /* But change only once! */
      if (size == 4)
        {
          buffer[i][0] = rgb[2];
          buffer[i][1] = rgb[1];
          buffer[i][2] = rgb[0];
        }
      else
        {
          /* this one is for old os2 Bitmaps, but it dosn't work well */
          buffer[i][0] = rgb[1];
          buffer[i][1] = rgb[0];
          buffer[i][2] = rgb[2];
        }
    }

  return 0;
}

static TTerrain *
bmp_read_image (FILE   *in,
                gint    width,
                gint    height,
                guchar  palette[256][3],
