<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.77 [fr] (X11; U; Linux 2.4.3-20mdk i586) [Netscape]">
   <title>Terraform Tutorial</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#000000" vlink="#000000" alink="#000000">

<h1>
Tutorial Terraform</h1>
<i>Auteur: David A. Bartold, Traduction: Raymond Ostertag</i>
<p>C'est un petit tutorial destin&eacute; aux d&eacute;butants.
<br>
<hr NOSHADE>
<p>Voici la fen&ecirc;tre principale :
<br><img SRC="../C/mainwindow.png" height=328 width=212>
<p>La fen&ecirc;tre principale permet &agrave; l'utilisateur d'ouvrir des
fen&ecirc;tres pour les terrains. L'utilisateur peut charger un terrain
depuis un fichier ou en cr&eacute;er un nouveau.
<h2>
Etape 1:</h2>
Il y a diff&eacute;rents algorithmes disponibles pour g&eacute;n&eacute;rer
un nouveau terrain. Nous allons laisser Terraform en choisir un en s&eacute;lectionnant
Fichier > Nouveau > Al&eacute;atoire. C'est la fa&ccedil;on la plus simple
de faire un nouveau terrain.
<p>La fen&ecirc;tre du terrain ressemblera &agrave; ceci :
<br><img SRC="../C/terrainwindow.png" height=394 width=316>
<h2>
Etape 2 :</h2>
S&eacute;lectionnez le mod&egrave;le de vue 3D filaire en choisissant Vue
> Type > 3D filaire. D&eacute;placez le curseur&nbsp; dans la fen&ecirc;tre
pour tourner le mod&egrave;le filaire comme souhait&eacute;. Essayez d'autres
mod&egrave;les de vue.
<p>Vue 3D filaire :
<br><img SRC="../C/wire.png" height=360 width=316>
<h2>
Etape 3 :</h2>
Allez &agrave; votre fen&ecirc;tre principale et s&eacute;lectionnez Fichier
> Options. L'onglet POV-Ray tab fait apparaitre le nom de l'ex&eacute;cutable.
Assurez-vous qu'il pointe vers une version compatible X-window de POV-Ray
3.1. Terraform va automatiquement chercher le bon ex&eacute;cutable si
vous cliquez sur le bouton "...". Cette option est sauvegard&eacute;e d'une
session &agrave; l'autre ainsi vous n'avez &agrave; faire cel&agrave; qu'une
fois.
<h2>
Etape 4 :</h2>
Allez &agrave; votre fen&ecirc;tre de terrain, s&eacute;lectionnez Fichier
> Rendu > POV-Ray et une fen&ecirc;tre de rendu devrait apparaitre.
<p>Si vous avez un message d'erreur c'est qu'il y a eu un probl&egrave;me
durant l'ex&eacute;cution de POV-Ray. Vous trouverez plus d'informations
en cliquant sur le bouton "D&eacute;tails". Consultez la documentation
de POV-Ray si l'ex&eacute;cutable est trouv&eacute; mais POV-Ray rapporte
une erreur.
<p>La fen&ecirc;tre de rendu du terrain de POV-Ray :
<br><img SRC="../C/povray.png" height=328 width=412>
<h2>
F&eacute;licitations !</h2>
Vous avez g&eacute;n&eacute;rez et rendu votre premi&egrave;re sc&egrave;ne.
<p>De l&agrave;, vous pourriez souhaitez la sauvegarder dans un fichier
*.terraform ou accomplir plusieurs op&eacute;rations sur le terrain. Consultez
le <a href="index.html">Guide Utilisateur</a> pour plus d'informations.
</body>
</html>
